let hello = "Hello World";
alert(hello);

// 【変数に代入できるコードの例】

// // 整数を代入する
// let int1 = 1;

// // 負数を代入する
// let int2 = -10;

// // 小数点を代入する
// let float1 = 3.14;

// // 文字列を代入する
// let str1 = 'JavaScriptを覚えよう';


// 【四則演算の書き方】

// // 足し算
// alert(4 + 3);

// // 引き算
// alert(8 - 5);

// // 掛け算
// alert(2 * 6);

// // 割り算
// alert(10 / 2);


// 文字列を結合する

// app.js
// alert('Hello' + 'World');

// let str1 = 'Hello';
// let str2 = 'World!!';
// alert(str1 + str2);


// 条件分岐
// 条件分岐でできることは、Rubyと同じです。ただし、書き方は異なります。注意しましょう。

// JavaScriptでの条件分岐は、以下のように記述します。

// 条件式が1つの場合

// if(条件1){
//   処理1
// }
// // 条件1を満たすときは、処理1を実行
// 1つの条件式で、処理を2つに分ける場合

// if(条件1){
//   処理1
// } else{
//   処理2
// }
// // 条件1を満たすときは処理1、満たさないときは処理2を実行
// 2つの条件式で処理を分ける場合

// if(条件1){
//   処理1
// } else if(条件2){
//   処理2
// } else{
//   処理3
// }


// 繰り返し処理
// while文
// // 引数の条件がtrueの間、波括弧内部の処理が繰り返される。
// while(条件){
// 処理
// }

// 【do...while文の記述】
// do{
//   最低1回は行われる処理
// }while(条件式);

// 【for文の記述】
// for ( 初期値; 条件式; 増減値 ){
//   繰り返し処理
// }